using GrammarGenerator.Generation;
using System;
using System.Numerics;
using System.Reflection;
using System.Runtime.Intrinsics.Arm;

namespace GrammarGenerator;

public static class Dictionaries
{
    public static readonly IReadOnlyCollection<string> RUS_DEF_PREFIXES = 
    [
        "900", "903", "905", "910", "911", "912", "913", "915", "916", "917",
        "919", "920", "921", "922", "923", "925", "926", "927", "928", "929",
        "930", "931", "950", "951", "952", "953", "955", "956", "958", "918",
        "960", "961", "962", "963", "964", "965", "966", "967", "968", "969",
        "977", "978", "980", "981", "982", "983", "984", "985", "986", "999",
        "987", "988", "989", "991", "992", "993", "994", "995", "996", "997",
    ];

    public static readonly IReadOnlyCollection<(string s, double w)> RUS_CITY_PREFIXES =
    [
        ("495", 0.0908), // Москва
        ("498", 0.0601), // Московская_область
        ("862", 0.0400), // Краснодарский край
        ("812", 0.0387), // Санкт-Петербург
        ("343", 0.0289), // Свердловская_область
        ("863", 0.0283), // Ростовская_область
        ("347", 0.0277), // Республика Башкортостан
        ("855", 0.0275), // Республика Татарстан
        ("345", 0.0269), // Тюменская_область
        ("351", 0.0232), // Челябинская_область
        ("872", 0.0223), // Республика Дагестан
        ("848", 0.0213), // Самарская_область
        ("831", 0.0208), // Нижегородская_область
        ("879", 0.0197), // Ставропольский край
        ("391", 0.0194), // Красноярский край
        ("383", 0.0191), // Новосибирская_область
        ("384", 0.0173), // Кемеровская_область
        ("342", 0.0170), // Пермский край
        ("844", 0.0167), // Волгоградская_область
        ("845", 0.0162), // Саратовская_область
        ("395", 0.0159), // Иркутская_область
        ("473", 0.0155), // Воронежская_область
        ("385", 0.0144), // Алтайский край
        ("813", 0.0141), // Ленинградская_область
        ("365", 0.0130), // Республика Крым
        ("381", 0.0124), // Омская_область
        ("353", 0.0124), // Оренбургская_область
        ("423", 0.0123), // Приморский край
        ("871", 0.0108), // Чеченская Республика
        ("472", 0.0101), // Белгородская_область
        ("487", 0.0100), // Тульская_область
        ("341", 0.0098), // Удмуртская Республика
        ("492", 0.0089), // Владимирская_область
        ("421", 0.0087), // Хабаровский край
        ("841", 0.0084), // Пензенская_область
        ("482", 0.0081), // Тверская_область
        ("485", 0.0081), // Ярославская_область
        ("842", 0.0080), // Ульяновская_область
        ("835", 0.0079), // Чувашская Республика
        ("483", 0.0078), // Брянская_область
        ("833", 0.0077), // Кировская_область
        ("820", 0.0076), // Вологодская_область
        ("491", 0.0074), // Рязанская_область
        ("484", 0.0073), // Калужская_область
        ("471", 0.0072), // Курская_область
        ("401", 0.0071), // Калининградская_область
        ("382", 0.0071), // Томская_область
        ("411", 0.0069), // Республика Саха
        ("818", 0.0068), // Архангельская_область
        ("302", 0.0067), // Забайкальский край
        ("301", 0.0066), // Республика Бурятия
        ("851", 0.0065), // Астраханская_область
        ("475", 0.0065), // Тамбовская_область
        ("866", 0.0062), // Кабардино-Балкарская Республика
        ("493", 0.0061), // Ивановская_область
        ("481", 0.0059), // Смоленская_область
        ("834", 0.0052), // Республика Мордовия
        ("416", 0.0052), // Амурская_область
        ("352", 0.0051), // Курганская_область
        ("821", 0.0049), // Республика Коми
        ("486", 0.0047), // Орловская_область
        ("836", 0.0046), // Республика Марий Эл
        ("867", 0.0046), // Республика Северная Осетия
        ("815", 0.0045), // Мурманская_область
        ("816", 0.0039), // Новгородская_область
        ("811", 0.0039), // Псковская_область
        ("494", 0.0038), // Костромская_область
        ("869", 0.0038), // Севастополь
        ("873", 0.0037), // Республика Ингушетия
        ("814", 0.0036), // Республика Карелия
        ("390", 0.0036), // Республика Хакасия
        ("349", 0.0036), // Ямало-Ненецкий автономный округ
        ("877", 0.0034), // Республика Адыгея
        ("878", 0.0032), // Карачаево-Черкесская Республика
        ("424", 0.0031), // Сахалинская_область
        ("394", 0.0023), // Республика Тыва
        ("415", 0.0020), // Камчатский край
        ("847", 0.0018), // Республика Калмыкия
        ("388", 0.0014), // Республика Алтай
        ("426", 0.0010), // Еврейская автономная_область
        ("413", 0.0009), // Магаданская_область
        ("818", 0.0003), // Ненецкий автономный округ
        ("427", 0.0003), // Чукотский автономный округ
    ];

    public static readonly IReadOnlyCollection<string> TAC_Examples =
    [
        "01154600", // iPhone  MB384LL
        "01161200", // iPhone 3G
        "01174400", // iPhone 3G   MB496RS
        "01180800", // iPhone 3G   MB704LL
        "01181200", // iPhone 3G   MB496B
        "01193400", // iPhone 3G
        "01194800", // iPhone 3GS
        "01215800", // iPhone 3GS
        "01215900", // iPhone 3GS  MC131B
        "01216100", // iPhone 3GS
        "01226800", // iPhone 3GS
        "01233600", // iPhone 4    MC608LL
        "01233700", // iPhone 4    MC603B
        "01233800", // iPhone 4    MC610LL
        "01241700", // iPhone 4
        "01242000", // iPhone 4
        "01243000", // iPhone 4    MC603KS
        "01253600", // iPhone 4    MC610LL/A
        "01254200", // iPhone 4
        "01300600", // iPhone 4S   MD260C
        "01326300", // iPhone 4    MD198HN/A
        "01332700", // iPhone 5    MD642C
        "01388300", // iPhone 5S   ME297C/A
        "35875105", // iPhone 5S   A1533
        "35875205", // iPhone 5S   A1533
        "35875305", // iPhone 5S   A1533
        "35875405", // iPhone 5S   A1533
        "35875505", // iPhone 5S   A1533
        "35875605", // iPhone 5S   A1453
        "35875705", // iPhone 5S   A1453
        "35875805", // iPhone 5S   A1453
        "35875905", // iPhone 5S   A1453
        "35876005", // iPhone 5S   A1453
        "35880005", // iPhone 5C   A1507
        "35880105", // iPhone 5C   A1507
        "35880205", // iPhone 5C   A1507
        "35880305", // iPhone 5C   A1507
        "35880405", // iPhone 5C   A1507
        "35880505", // iPhone 5S   A1453
        "35880605", // iPhone 5S   A1453
        "35880705", // iPhone 5S   A1453
        "35951406", // Galaxy Tab E    SM-T5613474
        "35880805", // iPhone 5S   A1453
        "35880905", // iPhone 5S   A1453
        "35881005", // iPhone 5S   A1533
        "35881105", // iPhone 5S   A1533
        "35881205", // iPhone 5S   A1533
        "35881305", // iPhone 5S   A1533
        "35881405", // iPhone 5S   A1533
        "35881505", // iPhone 5C   A1456
        "35881605", // iPhone 5C   A1456
        "35881705", // iPhone 5C   A1456
        "35881805", // iPhone 5C   A1456
        "35881905", // iPhone 5C   A1456
        "35201906", // iPhone 5S   A1457
        "35925406", // iPhone 6    A1549
        "35438506", // iPhone 6+   A1522
        "35325807", // iPhone 6S   A1633
        "35299209", // iPhone 8    A1905
        "3530340", // iPad 6th gen    A1954
        "35103627", // iPad 9th gen    A2603
        "35676211", // iPad Air 4th gen    A2324
        "3576677", // iPad Air 5th gen    A2589
        "35705623", // FastMile 5G Gateway 3.2     5G15-12W
        "35089080", // 3410    NHM-2NX
        "35099480", // 3410    NHM-2NX
        "35148420", // 3410    NHM-2NX
        "35148820", // 6310i   NPL-1
        "35151304", // E72-1   RM-530
        "35154900", // 6310i   NPL-1
        "35171005", // Ericsson   Xperia S
        "35174605", // Galaxy Nexus    Samsung GT-I9250, Samsung GT-I9250TSGGEN
        "35191405", // Defy Mini
        "35226005", // Galaxy SIII
        "35044670", // A50
        "35238402", // Ericsson   K770i
        "35274901", // 6233
        "35291402", // 6210 Navigator
        "35316004", // Blade
        "35316605", // Galaxy S III    GT-I9300
        "35332705", // Galaxy S II     GT-I9100
        "35328504", // Galaxy S    GT-I9000
        "32930400", // Galaxy S7
        "35351200", // V300
        "35357800", // SGH-A800
        "35376800", // 6230
        "35391805", // Nexus 4     LG E960
        "35405600", // M1306B
        "35421803", // 5310    RM-303
        "35433004", // C5-00   RM-645
        "35450502", // HSDPA Modem
        "35511405", // Ericsson   Xperia U
        "35524803", // 2330C-2     RM-512
        "35566600", // 6230
        "35569500", // 1100
        "35679404", // Galaxy Mini     GT-S5570
        "35685702", // 6300
        "35693803", // N900
        "35694603", // 2700
        "35699601", // N95
        "35700804", // C1
        "35714904", // E398U-15 LTE Stick
        "35733104", // Galaxy Gio
        "35739804", // N8
        "35744105", // Galaxy S4   GT-I9505
        "35765206", // Xperia Z3 Compact   D5803
        "35788104", // N950
        "35803106", // HTC One M8s
        "35824005", // Nexus 5     LG D820/D821
        "35828103", // 6303C
        "35836800", // 6230i
        "35837501", // Orbit 2
        "35837800", // N6030   RM-74
        "35838706", // G Stylo     LG-H631
        "35850000", // Lumia 720
        "35851004", // Ericsson   Xperia Active
        "35853704", // Galaxy SII
        "35869205", // iPhone 5S   MF353TA/A
        "35876105", // iPhone 5S   A1457
        "35896704", // Desire S
        "35902803", // Wildfire
        "35903908", // Galaxy S8   SM-G950F
        "35909205", // Galaxy Note 3   SM-N9000, SM-N9005, SM-N900
        "35918804", // One X
        "35920605", // Lumia 625
        "35447909", // Nokia 1     TA-1079
        "35604008", // Nokia 2     TA-1023
        "35602508", // Nokia 5     TA-1027
        "35929005", // Moto G  XT1039
        "35933005", // 6468
        "35935003", // 2720A-2     RM-519
        "35972100", // 544
        "35974101", // HSDPA Modem
        "35979504", // Galaxy Note
        "86107402", // Queclink GV200
        "86217001", // Queclink GV200
        "86723902", // Corporation     Rook from EE, Orange Dive 30, Blade A410
        "86813001", // G3S     JY-G3
        "00000000", // typical fake TAC codes, usually in software damaged phones
        "01234567",  // typical fake TAC codes, usually in software damaged phones
        "12345678",  // typical fake TAC codes, usually in software damaged phones
        "13579024",  // typical fake TAC codes, usually in software damaged phones
        "88888888"  // typical fake TAC codes, usually in software damaged phones
        "01333200", // iPhone 5
        "99000481", // Galaxy note 4 GM-N910V
        "35808005", // Sony C6833 - XPERIA Z ULTRA
        "35815207", // Samsung S7
        "35415808", // Samsung J7 Prime
        "35664906", // Xcover 271  GT-B2710
        "35330509", // Galaxy S9   SM-G960U
        "35326907", // iPhone 6s   A1688
        "35197310", // EyePay Phone
        "35664906", // Xcover 271  GT-B2710
        "35314409", // Mobile   GO Onyx LTE     GO1004
        "86092103", // P9 Lite 2016
        "35293708", // Galaxy A5 2016  SM-A510F
        "35684610", // Galaxy Fold 5G
        "01459300", // T-Mobile LineLink   ML700
        "86881303", // Redmi Note 5
        "35620409", // Galaxy J7 2017
        "35253108", // Google Pixel
        "35803408", // Google Pixel 2 XL (Verizon)     G011C
        "35803508", // Google Pixel 2 XL (Unlocked)    G011C
        "35964309", // Google Pixel 3a XL
        "35751110", // Google Pixel 4a
        "35751310", // Google Pixel 4a
        "86551004", // OnePlus 7 Pro (T-Mobile)    GM1915
        "86492106", // OnePlus 11  CPH2451
    ];

    public static readonly IReadOnlyCollection<(string s, double w)> MCC_Examples =
    [
        ("255", 2.5),
        ("310", 2.0),
        ("262", 2.0),
        ("234", 2.0),
        ("460", 1.5),
        ("404", 1.5),
        ("724", 1.0),
        ("208", 1.0)
    ];
}